README.md
```mermaid
flowchart LR
  %% System Context

  User[Operator]

  subgraph Host_OS
    X11[X Server]
    Docker[Docker Engine]
  end

  subgraph Docker_Container_ROS_Humble
    Turtlesim[turtlesim_node]
    Ctrl[TurtleLifecycleController LifecycleNode]
    ROS2[ROS 2 Middleware DDS]
  end

  User --> X11
  X11 <---> Turtlesim
  Ctrl <---> ROS2
  Turtlesim <---> ROS2
  Docker --- Docker_Container_ROS_Humble
```
